Revit 2027 API
AnalyticalPanel.Create(Document, Curve, XYZ) Method
 Creates a new instance of an Analytical Panel within the project.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static AnalyticalPanel Create(
	Document document,
	Curve profile,
	XYZ normal
)
Public Shared Function Create (
	document As Document,
	profile As Curve,
	normal As XYZ
) As AnalyticalPanel
public:
static AnalyticalPanel^ Create(
	Document^ document,
	Curve^ profile,
	XYZ^ normal
)
static member Create :
        document : Document *
        profile : Curve *
        normal : XYZ -> AnalyticalPanel
Parameters
document Document
 Revit document.
profile Curve
 Curve which represents the profile of the Analytical Panel.
normal XYZ
 Normal used for the extrusion of the profile.
Return Value
AnalyticalPanel
 The newly created AnalyticalPanel instance.
Exceptions
Exception | Condition
ArgumentException |  The profile argument is not valid for analytical panel creation. -or- The input profile is not bound. -or- The normal argument is not valid for analytical panel creation.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  Failed to create the analytical panel.
ModificationForbiddenException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process.
ModificationOutsideTransactionException |  The document has no open transaction.
Remarks
 Profile can be a line, an arc or an ellipse. In case of arcs and ellipses, the normal should be perpendicular to the profile plane.
See Also
Reference
AnalyticalPanel Class
Create Overload
Autodesk.Revit.DB.Structure Namespace